### Numpy Library

- Processing N-Dimensional arrays

In [10]:
import numpy as np

li=[1,2,3,'z']
a=np.array(li)
#type(a)
a

b=np.arange(15)
b

array([ 0,  1,  2,  3,  4,  5,  6,  7,  8,  9, 10, 11, 12, 13, 14])

In [11]:
rn=np.random.randint(0,100,size=10)
rn

array([80, 24, 10, 13, 17, 57, 10, 91, 37,  3])

In [31]:
m3=np.random.randint(0,2,size=(3,3,3,3))
m3[2][2][2][1]

0

In [38]:
m3.ndim ##-----represent the dimension
m3.size ##------represent the size
m3.shape ##-----represent the rows and columns
m3.dtype #-----represent the type of data
m3.itemsize ##----represent the size of  each elementm in bytes
m3.nbytes

324

In [41]:
t=[1,2,3]
t.insert(2,4)
t

[1, 2, 4, 3]

In [ ]:
'''
# Sample code to perform I/O:

name = input()                  # Reading input from STDIN
print('Hi, %s.' % name)         # Writing output to STDOUT

# Warning: Printing unwanted or ill-formatted data to output will cause the test cases to fail
'''

# Write your code here
n=input()
n=n.split()
#print(n)
t=input()
t=t.split()
t=list(map(int,t))
#print(type(t[0]))

def array1(t):
    avg=0
    for i in range(0,int(n[1])):
        if q[0]==1:
            t.insert(q[1],q[2])
            t.pop(q[1]+1)
        #print(t)
        else:
            for i in range(q[1],q[2]+1):
                avg=avg+t[i]
        print(avg//(q[2]-q[1]))
    return

for i in range(0,int(n[1])):
    q=input()
    q=q.split()
    q=list(map(int,q))
    #print(q)
    array1(t)

### Pandas

- **Use cases**
    * Data Cleaning
    * Data Transformation
    * Data Analysis
- **Notations**
    * Series
    * Data Frames

In [46]:
import pandas as pd

internal1={'s1':21,'s2':18,'s3':24}
internal1=pd.Series(internal1)
print(internal1)
internal2={'s1':1,'s2':20,'s3':2}
internal2=pd.Series(internal2)
print(internal2)

s1    21
s2    18
s3    24
dtype: int64
s1     1
s2    20
s3     2
dtype: int64

In [60]:
final={'Internal1':internal1,'Internal2':internal2}
final=pd.DataFrame(final)
final

    Internal1  Internal2
s1         21          1
s2         18         20
s3         24          2

In [50]:
final.columns # names of all columns

Index(['Internal1', 'Internal2'], dtype='object')

In [52]:
final.values # lists of all rows

array([[21,  1],
       [18, 20],
       [24,  2]], dtype=int64)

In [53]:
final.values[2]

array([24,  2], dtype=int64)

In [54]:
final.values[2,0]

24

In [57]:
for row in final.values:
    print("Internal1 - ",row[0],', Internal2 - ',row[1])

Internal1 -  21 , Internal2 -  1
Internal1 -  18 , Internal2 -  20
Internal1 -  24 , Internal2 -  2

In [66]:
final.loc[3]=[15,18]
final

    Internal1  Internal2
s1         21          1
s2         18         20
s3         24          2
3          15         18

In [73]:
final.drop(3)

    Internal1  Internal2
s1         21          1
s2         18         20
s3         12         25

In [74]:
final.values[2]=[12,25]
final

    Internal1  Internal2
s1         21          1
s2         18         20
s3         12         25
3          15         18

In [75]:
# Reading csv filedata 
import pandas as pd
filepath='DataFiles/income.csv'
incomedf = pd.read_csv(filepath)
incomedf

,GEOID,State,2005,2006,2007,2008,2009,2010,2011,2012,2013
0,04000US01,Alabama,37150,37952,42212,44476,39980,40933,42590,43464,41381
1,04000US02,Alaska,55891,56418,62993,63989,61604,57848,57431,63648,61137
2,04000US04,Arizona,45245,46657,47215,46914,45739,46896,48621,47044,50602
3,04000US05,Arkansas,36658,37057,40795,39586,36538,38587,41302,39018,39919
4,04000US06,California,51755,55319,55734,57014,56134,54283,53367,57020,57528

In [77]:
# Extract income of all states in 2013
#California : 57528

for row in incomedf.values:
    print(row[1],':',row[-1])

Alabama : 41381
Alaska : 61137
Arizona : 50602
Arkansas : 39919
California : 57528

In [78]:
# Average income of Arizona
sum=0
for row in range(2,11):
    sum+=incomedf.values[2][row]
sum/len(incomedf.values[2][2:])

47214.77777777778

In [80]:
# Average income of all states in 2012

sum=0
for i in incomedf.values:
    sum+=i[-2]
sum/len(incomedf.values)

50038.8